## CATEGORICAL ENCODING

- Ordinal number encoding
- Count/ frequency encoding
- Target guided ordinal encoding
- Mean encoding
- Probability Ratio encoding

# Ordinal number encoding

ordinal number encoding can be defined as where the categories can be ordered in such a way where we can assign ranks

example : GRADING SYSTEM

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import datetime
import calendar

In [36]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2022, 11, 22, 11, 5, 54, 412992)

In [37]:
# this gives the day befor or after from today

today_date - datetime.timedelta(1)

datetime.datetime(2022, 11, 21, 11, 5, 54, 412992)

In [38]:
# list comprehension

dates = [today_date - datetime.timedelta(x) for x in range (0,15)]
dates

[datetime.datetime(2022, 11, 22, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 21, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 20, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 19, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 18, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 17, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 16, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 15, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 14, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 13, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 12, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 11, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 10, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 9, 11, 5, 54, 412992),
 datetime.datetime(2022, 11, 8, 11, 5, 54, 412992)]

In [39]:
df = pd.DataFrame(dates)

In [40]:
df.columns = ['Days']
df.head(5)

                        Days
0 2022-11-22 11:05:54.412992
1 2022-11-21 11:05:54.412992
2 2022-11-20 11:05:54.412992
3 2022-11-19 11:05:54.412992
4 2022-11-18 11:05:54.412992

In [46]:
'''
dt.dayofweek
dt.day
dt.day_name() '''

# create a feature with the name of those days

df['day_name']  = df['Days'].dt.day_name()
df.head()

                        Days  day_name
0 2022-11-22 11:05:54.412992   Tuesday
1 2022-11-21 11:05:54.412992    Monday
2 2022-11-20 11:05:54.412992    Sunday
3 2022-11-19 11:05:54.412992  Saturday
4 2022-11-18 11:05:54.412992    Friday

In [52]:
# let us rank the day_names through mapping

dict= {'Monday':1, 'Tuesday':2, 'Wednesday':3, 'Thursday':4, 'Friday':5, 'Saturday':6, 'Sunday':7}
dict

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [53]:
df['day_ordinal']  = df['day_name'].map(dict)
df.head()

                        Days  day_name  day_ordinal
0 2022-11-22 11:05:54.412992   Tuesday            2
1 2022-11-21 11:05:54.412992    Monday            1
2 2022-11-20 11:05:54.412992    Sunday            7
3 2022-11-19 11:05:54.412992  Saturday            6
4 2022-11-18 11:05:54.412992    Friday            5

# # #

# COUNT or FREQUENCY Encoding

- usually we handle the categorical feature by changing it into a numerical feature

- same way here we are going to replace the categorical features with their frequency

In [43]:
df =  pd.read_csv('D:\\CS50\\projects data set\\govt\\adult.data', header = None,index_col=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [44]:
# lets take the categorical columns ALONE

columns = [1,3,5,6,7,8,9,13]

In [45]:
# selecting only categorical values in the df

df = df[columns]
df.head()

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [46]:
# lets change the column names

df.columns = ['Employment', 'Degree', 'Status', 'Designation', 'family_job', 'Race', 'Sex', 'Country']
df.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [47]:
for features in df.columns[:] :
        
        print(features , ":", len(df[features].unique()), 'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [48]:
# let consider the country column for one hot encoding
# so let us pick the top ten frequent labels in the country columns

df['Country'].value_counts().sort_values(ascending=False).head(10)

 United-States    29170
 Mexico             643
 ?                  583
 Philippines        198
 Germany            137
 Canada             121
 Puerto-Rico        114
 El-Salvador        106
 India              100
 Cuba                95
Name: Country, dtype: int64

In [49]:
# lets convert into dictionary

country_frequency = df['Country'].value_counts().sort_values(ascending =False).head(10).to_dict()
country_frequency

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95}

In [50]:
# count_frequency encode

df['Country'] = df['Country'].map(country_frequency)
df.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170.0
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170.0
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170.0
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170.0
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95.0

## Convert all other categorical features into numerical by count frequency encoding

In [51]:
column_name =['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [52]:
for variable in column_name:
    
    variable_frequency = df[variable].value_counts().sort_values(ascending =False).head(10).to_dict()
    df[variable] = df[variable].map(variable_frequency)

In [53]:
df.head()

   Employment   Degree  Status  Designation  family_job   Race    Sex  Country
0        1298   5355.0   10683       3770.0        8305  27816  21790  29170.0
1        2541   5355.0   14976       4066.0       13193  27816  21790  29170.0
2       22696  10501.0    4443       1370.0        8305  27816  21790  29170.0
3       22696   1175.0   14976       1370.0       13193   3124  21790  29170.0
4       22696   5355.0   14976       4140.0        1568   3124  10771     95.0

- COMPLETED CONVERTION OF CATEGORICAL INTO NUMERICAL

### Conclusion

- **every categorical features are changed into numerical features.**

## Advantages:

- 1. easy to use
- 2. dont increase the dimensionality

## Disadvantages:

- 1. if two labels have same number of frequency (value_counts()), then it cannot handle. It will provide the same weights when the frequency is same

# * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

# TARGET GUIDED ORDINAL ENCODING



-
**BASED ON THE TARGET**

- based on the output feature.....we find the mean of the categorical labels in the input features

- enumerate ranks for the categorical labels in a new feature.

- replace the labels by joint probability of being 1 or 0

In [58]:
df = pd.read_excel("D:\\CS50\\projects data set\\titanic_dataset\\titanic.xlsx", usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [59]:
df.Cabin.fillna('MISSING', inplace=True)
df.head()

   Survived    Cabin
0         0  MISSING
1         1      C85
2         1  MISSING
3         1     C123
4         0  MISSING

In [60]:
# let us see the how the cabin is categorised , so lets us take the first letter of 
# the labels in the cabin feature to make easy to groupby.

# M means - missing

df.Cabin = df.Cabin.str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [61]:
# it looks easy to categories it like ( c,m,....)

df.groupby('Cabin')['Survived'].mean().sort_values()

# shows the percentage of people survived in that paricular cabin in ASCENDING ORDER

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [62]:
# grab the index of the percentage of people survived in particular cabin

ordinal_label = df.groupby('Cabin')['Survived'].mean().sort_values().index
ordinal_label

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [65]:
# RANKING

# k:i ---> k represents the labels,  i represents the enumeration numbers
# let us do a for loop to enumerate the labels and put it inside a dictionary
# enumerate from 0 .....(enumerate (ordinal_label, 0) )


ordinal_label_2  = {k:i for i,k in enumerate(ordinal_label, 0)}
ordinal_label_2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [66]:
df['cabin_ordinal_labels'] = df.Cabin.map(ordinal_label_2)
df.head()

   Survived Cabin  cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

SO What is **TARGETED** here is ..... based on the output feature **('SURVIVED')** ,

we find the **mean** which explains the percentage of survival rate from a **( CABIN )** 
and assigning the ranks to the cabin by enumeration

# * * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * ** * * *

# MEAN ENCODING

- In Target guided encoding we find the mean based on the target and assign ranks for the categorical labels based on the mean.

- In the MEAN encoding we find the mean based on the target and assign the mean directly to the categorical labels.

In [67]:
# based on the target 'SURVIVED'(output) find the mean of the categorical labels in the cabin


mean_ordinal = df.groupby('Cabin')['Survived'].mean().to_dict()
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [68]:
# map the mean_ordinal to the cabin in a new feature

df['mean_ordinal_encode'] = df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854

- in the target guided method we ranked according to the mean percent of survival, and created a feature by filling it with ordinal ranks


- in the mean encoding we directly used the mean without ranking it, and created a feature by filling it with mean values

## Disadvantages:

- this process leads to overfitting

# PROBABILITY RATIO ENCODING

1. probability of survived based on cabin
2. probability of not survived based on cabin = 1 - pr('survived)
3. pr(survived) / pr(not survive)
4. map the dictionary with probability
5. replace withthe categorical feature

In [98]:
df = pd.read_excel("D:\\CS50\\projects data set\\titanic_dataset\\titanic.xlsx", usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [99]:
# Replacing NAN with other category 'MISSING'

df['Cabin'].fillna('MISSING',inplace =True)
df.head()

   Survived    Cabin
0         0  MISSING
1         1      C85
2         1  MISSING
3         1     C123
4         0  MISSING

In [100]:
df['Cabin'] = df['Cabin'].str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [110]:
# To find the probability of survival based on cabin ------find the mean based on the output feature

percent_survived = df.groupby('Cabin')['Survived'].mean()

probability = pd.DataFrame(percent_survived)
probability

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [111]:
# what is the probability that the person died ?

probability['died'] = 1- survival_percent['Survived']
probability

       Survived      died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000
F      0.615385  0.384615
G      0.500000  0.500000
M      0.299854  0.700146
T      0.000000  1.000000

In [112]:
# PROBABILITY RATIO ENCODING

probability['probability_ratio'] = survival_percent['Survived'] / survival_percent['died']
probability

       Survived      died  probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000
F      0.615385  0.384615           1.600000
G      0.500000  0.500000           1.000000
M      0.299854  0.700146           0.428274
T      0.000000  1.000000           0.000000

In [114]:
# convert the data into dictionary 

probability['probability_ratio'].to_dict()

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [115]:
#  map it to the df 

probability_encode = probability['probability_ratio'].to_dict()

In [116]:
df['probability_ratio_Cabin_encoded'] = df['Cabin'].map(probability_encode)
df

     Survived Cabin  probability_ratio_Cabin_encoded
0           0     M                         0.428274
1           1     C                         1.458333
2           1     M                         0.428274
3           1     C                         1.458333
4           0     M                         0.428274
..        ...   ...                              ...
886         0     M                         0.428274
887         1     B                         2.916667
888         0     M                         0.428274
889         1     C                         1.458333
890         0     M                         0.428274

[891 rows x 3 columns]